---
kind: property
id: P:Autodesk.Revit.DB.MeshTriangle.Vertex(System.Int32)
source: html/add4884d-fb0b-225c-a8df-4ae183607500.htm
---
# Autodesk.Revit.DB.MeshTriangle.Vertex Property

A vertex of the triangle.

## Syntax (C#)
```csharp
public XYZ this[
	int idx
] { get; }
```

## Parameters
- **idx** (`System.Int32`) - Index of the vertex in the triangle: 0, 1 or 2.